{
  "content:ebb7876dc7dad0aa": {
    "id": "content:ebb7876dc7dad0aa",
    "url": "https://gps.northcentrallondon.icb.nhs.uk/news/hsl-review-pathology-test-results-look-up-system-goes-live",
    "title": "News: HSL Review pathology test results look&#45;up system goes live",
    "source": "ncl",
    "type": "article",
    "publishedDate": "2026-02-26",
    "fetchedDate": "2026-02-27T17:47:20.660Z",
    "contentHash": "e4b7a17963dcc7d9",
    "content": "Supporting improved clinical decision-making by bringing together results from Royal Free, Barnet, Chase Farm, North Middlesex University Hospital, Whittington Health and University College London Hospitals sites into a single, easy-to-navigate interface.",
    "parentUrl": null,
    "metadata": {
      "wordCount": 31,
      "estimatedReadTime": 1,
      "description": "Supporting improved clinical decision-making by bringing together results from Royal Free, Barnet, Chase Farm, North Middlesex University Hospital, Whittington Health and University College London Hos"
    }
  },
  "content:7d44f8d5ae790eb7": {
    "id": "content:7d44f8d5ae790eb7",
    "url": "https://gps.northcentrallondon.icb.nhs.uk/services/adult-hospital-at-home-nmuh",
    "title": "Service: Adult Hospital at Home: NMUH",
    "source": "ncl",
    "type": "article",
    "publishedDate": "2026-02-26",
    "fetchedDate": "2026-02-27T17:47:20.660Z",
    "contentHash": "2b5f72bf524f33e7",
    "content": "Service update: NMUH&#039;s Adult Hospital at Home accepts direct GP referrals, providing acute care for adults in their usual residence, preventing unnecessary hospital admissions.",
    "parentUrl": null,
    "metadata": {
      "wordCount": 24,
      "estimatedReadTime": 1,
      "description": "Service update: NMUH&#039;s Adult Hospital at Home accepts direct GP referrals, providing acute care for adults in their usual residence, preventing unnecessary hospital admissions."
    }
  },
  "content:ec7751a7d79e0bd0": {
    "id": "content:ec7751a7d79e0bd0",
    "url": "https://gps.northcentrallondon.icb.nhs.uk/referral-support/planned-care-wait-times/urgent-suspected-cancer-indicative-wait-for-first-appointment-data",
    "title": "Page: Urgent suspected cancer: Indicative wait for first appointment data",
    "source": "ncl",
    "type": "article",
    "publishedDate": "2026-02-26",
    "fetchedDate": "2026-02-27T17:47:20.661Z",
    "contentHash": "0a910b8cf70834b7",
    "content": "Continued capacity constraints across north central London are leading to longer waits for patients following urgent suspected cancer first appointments (previously known as 2WW). See the latest data.",
    "parentUrl": null,
    "metadata": {
      "wordCount": 28,
      "estimatedReadTime": 1,
      "description": "Continued capacity constraints across north central London are leading to longer waits for patients following urgent suspected cancer first appointments (previously known as 2WW). See the latest data."
    }
  },
  "content:13c6f12d4057ab28": {
    "id": "content:13c6f12d4057ab28",
    "url": "https://gps.northcentrallondon.icb.nhs.uk/news/finchley-memorial-cdc-update-temporary-pause-on-cardiology-referrals-24-hour-tape-echocardiograms",
    "title": "News: Finchley Memorial CDC update: Temporary pause on cardiology referrals (24&#45;hour tape &amp; echocardiograms)",
    "source": "ncl",
    "type": "article",
    "publishedDate": "2026-02-25",
    "fetchedDate": "2026-02-27T17:47:20.661Z",
    "contentHash": "92194c9666491fd2",
    "content": "The tests will be reintroduced for GP direct access via choose and book from 1 April 2026, once the current patient backlog has been cleared.",
    "parentUrl": null,
    "metadata": {
      "wordCount": 25,
      "estimatedReadTime": 1,
      "description": "The tests will be reintroduced for GP direct access via choose and book from 1 April 2026, once the current patient backlog has been cleared."
    }
  },
  "content:f367e219aca303c1": {
    "id": "content:f367e219aca303c1",
    "url": "https://gps.northcentrallondon.icb.nhs.uk/news/lab-introduces-more-accurate-cholesterol-measurements",
    "title": "News: Lab introduces more accurate cholesterol measurements",
    "source": "ncl",
    "type": "article",
    "publishedDate": "2026-02-25",
    "fetchedDate": "2026-02-27T17:47:20.661Z",
    "contentHash": "24e288889dccd059",
    "content": "Changed methodology at Health Services Laboratories (HSL) has enabled more accurate reporting of LDL-cholesterol (LDL-C) in patients with serum triglycerides up to 9.0 mmol/L.",
    "parentUrl": null,
    "metadata": {
      "wordCount": 24,
      "estimatedReadTime": 1,
      "description": "Changed methodology at Health Services Laboratories (HSL) has enabled more accurate reporting of LDL-cholesterol (LDL-C) in patients with serum triglycerides up to 9.0 mmol/L."
    }
  },
  "content:622cad0abc361d4c": {
    "id": "content:622cad0abc361d4c",
    "url": "https://gps.northcentrallondon.icb.nhs.uk/news/update-to-recall-of-several-nestle-r-sma-r-specialist-and-standard-infant-formula",
    "title": "News: Update to recall of several Nestle® SMA® specialist and standard infant formula",
    "source": "ncl",
    "type": "article",
    "publishedDate": "2026-02-25",
    "fetchedDate": "2026-02-27T17:47:20.662Z",
    "contentHash": "47f88536887692c5",
    "content": "The UK Health Security Agency has issued updated briefing notes on the infant and follow-on formula recall due to possible cereulide toxin contamination. These should be read in conjunction with the previous notes.",
    "parentUrl": null,
    "metadata": {
      "wordCount": 33,
      "estimatedReadTime": 1,
      "description": "The UK Health Security Agency has issued updated briefing notes on the infant and follow-on formula recall due to possible cereulide toxin contamination. These should be read in conjunction with the p"
    }
  },
  "content:4829140b1ac94f94": {
    "id": "content:4829140b1ac94f94",
    "url": "https://gps.northcentrallondon.icb.nhs.uk/news/reminder-use-correct-faecal-calprotectin-testing-containers",
    "title": "News: Update: Which container to use for faecal calprotectin tests",
    "source": "ncl",
    "type": "article",
    "publishedDate": "2026-02-25",
    "fetchedDate": "2026-02-27T17:47:20.662Z",
    "contentHash": "34607346052f4381",
    "content": "See which container to use when. Samples collected in the incorrect container will be rejected and not processed, causing delays.",
    "parentUrl": null,
    "metadata": {
      "wordCount": 20,
      "estimatedReadTime": 1,
      "description": "See which container to use when. Samples collected in the incorrect container will be rejected and not processed, causing delays."
    }
  },
  "content:2f73361c1daacdf2": {
    "id": "content:2f73361c1daacdf2",
    "url": "https://gps.northcentrallondon.icb.nhs.uk/news/medicines-supply-notification-phenobarbital-30mg-and-60mg-tablets",
    "title": "News: Medicines Supply Notification: Phenobarbital 30mg and 60mg tablets",
    "source": "ncl",
    "type": "article",
    "publishedDate": "2026-02-24",
    "fetchedDate": "2026-02-27T17:47:20.662Z",
    "contentHash": "80eb10f422127ea3",
    "content": "Phenobarbital tablets are in short supply, with resupply expected at the end of March 2026. Prescribers are advised not to start new patients on these medications. Read more",
    "parentUrl": null,
    "metadata": {
      "wordCount": 28,
      "estimatedReadTime": 1,
      "description": "Phenobarbital tablets are in short supply, with resupply expected at the end of March 2026. Prescribers are advised not to start new patients on these medications. Read more"
    }
  },
  "content:3385b994b054a7ba": {
    "id": "content:3385b994b054a7ba",
    "url": "https://www.england.nhs.uk/2026/02/patients-handed-over-quicker-despite-5-year-high-in-number-taken-to-hospital/",
    "title": "Patients handed over quicker despite 5-year high in number taken to hospital",
    "source": "nhs",
    "type": "article",
    "publishedDate": "Thu, 26 Feb 2026 16:00:13 +0000",
    "fetchedDate": "2026-02-27T17:47:21.178Z",
    "contentHash": "026836ee6425b490",
    "content": "Ambulance crews and A&E staff have slashed handover delays by more than 7 minutes this winter even as they ferried the highest number of patients to hospital in half a decade. \n\nFigures out today show that more than 1.2million patients were handed over (1,234,731) to A&Es by ambulances so far this winter.\n\nThis is the highest since the same period in 2021/22, and almost 52,000 (51,989) more than the equivalent period last year.\n\nDespite the 5-year high figure, ambulances and A&E staff combined to handover over patients more than 7 minutes quicker last week (28:14) than the same week last year (35:36).\n\nThe number of ambulance handovers taking over 30 minutes was also down by more than a fifth (21.9%) compared with the same week last year.\n\nThe number of patients in hospital with norovirus (924) was slightly down on last week (1012) and the almost 19 million (18.8 million) flu vaccinations delivered this year have helped ensure the number of patients in hospital beds continues to fall this week to 682.\n\nNHS National Medical Director Professor Meghana Pandit said: “Despite ever-increasing demand, especially on emergency care, it’s fantastic to see that the hard work of NHS staff has continued to deliver improvements for patients this winter.\n\n“Ambulance crews are getting people into hospital faster, working with A&E staff so they can be treated sooner, and vaccination teams have helped reduce the number of cases of flu.\n\n“The public deserve credit too from getting their jabs in ever increasing numbers, which has helped to ease spread of winter bugs, through to using more services in the community, where it’s more appropriate than going straight to A&E.\n\n“It’s really important this team effort continues as we see out another challenging winter”.\n\nMinister of State for Health Karin Smyth said: “As we move towards spring, it’s good to see patients are getting urgent care faster, despite huge demand, as the NHS continues its road to recovery.\n\n“This is a result of the hard work of NHS staff and government action to keep people safe by expanding GP access, improving vaccine uptake and harnessing technology, to help more people stay well at home rather than in hospital.\n\n“But we’re not resting on our laurels. There is still much more to do, and well redouble our efforts to make sure this improvement continues”.\n\nDate published : 26 February, 2026 \n\nDate last updated : 27 February, 2026 \n\nTopics\n\nUrgent and emergency care \nVaccination",
    "parentUrl": null,
    "metadata": {
      "wordCount": 408,
      "estimatedReadTime": 2,
      "description": "Ambulance crews and A&#38;E staff have slashed handover delays by more than 7 minutes this winter &#8211; even as they ferried the highest number of patients to hospital in half a decade. Figures out today show that more than 1.2million patients were handed over (1,234,731) to A&#38;Es by ambulances so far this winter. This is [&#8230;]"
    }
  },
  "content:556a6b8586933b20": {
    "id": "content:556a6b8586933b20",
    "url": "https://www.england.nhs.uk/2026/02/women-attending-first-nhs-mammogram-hits-10-year-high-as-thousands-more-cancers-found/",
    "title": "Women attending first NHS mammogram hits 10-year high as thousands more cancers found",
    "source": "nhs",
    "type": "article",
    "publishedDate": "Thu, 19 Feb 2026 11:13:44 +0000",
    "fetchedDate": "2026-02-27T17:47:21.694Z",
    "contentHash": "e13bff7b2cb787dc",
    "content": "Hundreds of thousands more women attended NHS breast screening last year and thousands more cancers were diagnosed early in England. \n\nNew figures today show that in 2024/25, 1.94 million women aged 50 to 70 attended screening within six months of invitation – up nearly 200,000 (193,745) from 1.75 million the previous year.\n\nAs a result, nearly 20,000 cancers (19,291) were detected – 9 cases in every 1,000 women screened – which is up almost 16% on the previous year, when 16,677 cancers were diagnosed through NHS breast screening.\n\nThis means thousands more women were able to access treatment earlier, when there are more options available and treatment is more likely to be effective.\n\nEncouragingly, attendance among women invited for screening for the first time reached 63.6% – the highest level in a decade – with 4.79 million eligible women now up to date with their breast screening – also a ten-year high.\n\nOverall, around 71.8% of eligible women are now up to date with screening under the programme’s three-year standard, up 1.8 percentage points on last year.\n\nDespite this progress, the latest statistics from the NHS Breast Screening Programme show that around three in ten women did not take up the offer of screening.\n\nLocal screening services are working with NHS England to improve uptake, including targeted outreach in lower-attending areas, reminder texts and expanded use of mobile screening units to bring services closer to home.\n\nThe NHS also launched its first-ever national breast screening campaign in February last year to support even more women to come forward.\n\nBacked by charities including Breast Cancer Now, the campaign featured public figures including Victoria Derbyshire, Julia Bradbury and Shirley Ballas who all shared personal messages to encourage women to attend.\n\nDuring the campaign period, the NHS saw a huge increase in people accessing information online, with tens of thousands of women visiting NHS breast screening pages in a single week and clicks to the screening service finder rising sharply.\n\nDr Harrison Carter, Director of Screening at NHS England, said : “Breast screening can save lives. With nearly 20,000 cancers detected early through screening last year, it’s encouraging to see more women attending, especially those invited for the first time, because making screening a habit can help protect your health for years to come.”\n\n“But we know there are a range of reasons why some women don’t come forward and there is much more still to do to support more women to access breast screening. If you receive an invitation, please don’t ignore it. It’s an appointment that could save your life.”\n\nPhilomena, whose breast cancer was detected through routine screening, said she nearly ignored her invitation before deciding to attend: “Encouraging women to attend their breast screening appointment is something that I am extremely passionate about, as I know how much it matters. I’ve lost friends who might still be here if their cancer had been found earlier, and I very nearly ignored my own screening invitation, too. At the time, I didn’t want to disrupt a new job I loved, but that small delay could have cost me everything.\n\nWhen I finally went for my mammogram, it led to the early detection of stage 2 breast cancer. Hearing those words was devastating, but catching it early meant I had a fighting chance. Treatment was challenging, but it gave me my life back, and it strengthened my commitment to raising awareness about the importance of breast screening in my community.\n\nScreening is quick, free, and could be the difference between catching cancer early or too late. Please make the time for your appointment. Prioritising your health isn’t selfish it’s essential. My screening saved my life, and it could save yours too.”\n\nWomen aged 50 up to the age of 71 are invited for breast screening every three years, with appointments provided locally through clinics and mobile units.\n\nBreast screening does have some risks. Some women who have screening will be diagnosed and treated for slow-growing breast cancers that may never otherwise have been found or caused them harm. Mammograms also do not always find a cancer that is there, but most people feel the benefits of breast screening outweigh the possible risks.\n\nRead more about NHS plans for breast screening .\n\nAdditional information\n\n3-year screening coverage (women screened within 36 months): 71.8%, up 1.8 percentage points on 2023/24\n\noverall uptake (aged 50–70): 70.6%, up from 70.0% last year\n\ninvitations issued: 2.75 million (around 10% increase)\n\nwomen screened (routine programme): 1.94 million women aged 50–70 attended screening within six months of invitation, up from 1.75 million the previous year\n\noverall screening activity: 2.15 million women aged 45+ were screened in 2024/25, a 10.3% increase on 2023/24\n\ncancers detected through screening: 19,291 (rate of 9.0 per 1,000 screened)\n\nfirst-invite uptake: 63.6%, the highest level in 10 years\n\nfollowing the national campaign launch, NHS breast screening advice pages recorded more than 32,000 visits in one week, a 145% increase\n\nall figures relate to the 2024/25 NHS Breast Screening Programme annual statistics \n\nDate published : 19 February, 2026 \n\nDate last updated : 19 February, 2026 \n\nTopics\n\nCancer \nPatient care",
    "parentUrl": null,
    "metadata": {
      "wordCount": 853,
      "estimatedReadTime": 4,
      "description": "Hundreds of thousands more women attended NHS breast screening last year and thousands more cancers were diagnosed early in England. New figures today show that in 2024/25, 1.94 million women aged 50 to 70 attended screening within six months of invitation – up nearly 200,000 (193,745) from 1.75 million the previous year. As a result, [&#8230;]"
    }
  },
  "content:45e2227fbc5c5969": {
    "id": "content:45e2227fbc5c5969",
    "url": "https://www.england.nhs.uk/2026/02/nhs-facing-second-surge-in-vomiting-virus-as-cases-reach-highest-level-this-winter/",
    "title": "NHS facing ‘second surge’ in vomiting virus as cases reach highest level this winter",
    "source": "nhs",
    "type": "article",
    "publishedDate": "Thu, 19 Feb 2026 11:06:28 +0000",
    "fetchedDate": "2026-02-27T17:47:22.307Z",
    "contentHash": "33a6dbe98adbc08d",
    "content": "The NHS could be facing a “second surge” in norovirus as the vomiting bug reaches its highest level so far this winter. \n\nFigures published today show the average number of patients in hospital with norovirus each day this week rose to over 1,000 for the first time this winter (1,012).\n\nThe total is a jump of almost 9% (8.9%) in cases compared with the previous week (929), as NHS staff continued to deliver care for patients amid record winter pressures.\n\nThe average number of norovirus patients in hospitals per day rose by more than 2.5 times from the start to the end of January (from 361 to 950).\n\nHaving briefly stabilised in the first week of February, figures have now been rising again for the second week in a row, prompting fears of a second surge.\n\nNHS doctors have urged the public to help prevent the spread of norovirus to loved ones and colleagues by taking simple steps including good hand hygiene and avoiding schools and places of work until they have been symptom-free for two days.\n\nThe average daily number of adult hospital beds closed due to norovirus symptoms this week (1,257) is also up more than 8% (8.2%) on last week (1,162) – and has risen by over 190% on the first full week of January (432).\n\nThis comes as hospitals continue to deal with high levels of demand, with almost 3,000 (2,837) more ambulance handovers with known handover times compared with the same week last year. Despite this, teams continued to handover patients on average more quickly than last year (32:03 vs 32:23).\n\nNHS national medical director, Dr Claire Fuller, said : “It’s vital that we do all we can to avoid a second surge in norovirus at a time when the NHS remains flat out coping with winter pressures.\n\n“The public has a huge role to play in stopping the spread of this bug by taking some simple precautions like good hand hygiene with regular handwashing with soap and water.\n\n“If you have symptoms, stay home, rest and drink fluids, and please don’t go to places like, schools, workplaces, hospitals and care homes until you have been symptom free for at least two days.\n\n“If you have any concerns about norovirus symptoms, local pharmacies can provide support and advice and remedies, or please contact 111 or use 111 Online.”\n\nDate published : 19 February, 2026 \n\nDate last updated : 19 February, 2026 \n\nTopics\n\nWinter news and guidance",
    "parentUrl": null,
    "metadata": {
      "wordCount": 411,
      "estimatedReadTime": 2,
      "description": "The NHS could be facing a “second surge” in norovirus as the vomiting bug reaches its highest level so far this winter. Figures published today show the average number of patients in hospital with norovirus each day this week rose to over 1,000 for the first time this winter (1,012). The total is a jump [&#8230;]"
    }
  },
  "content:7e7798edd70f3c38": {
    "id": "content:7e7798edd70f3c38",
    "url": "https://www.england.nhs.uk/2026/02/nhs-talking-therapies-completely-changed-my-life-nhs-launches-major-campaign-to-support-millions-more-people-with-anxiety/",
    "title": "“NHS talking therapies completely changed my life”: NHS launches major campaign to support millions more people with anxiety",
    "source": "nhs",
    "type": "article",
    "publishedDate": "Wed, 18 Feb 2026 00:01:46 +0000",
    "fetchedDate": "2026-02-27T17:47:22.822Z",
    "contentHash": "e09d5e4cb4b2b519",
    "content": "Millions of adults facing debilitating anxiety conditions are missing out on treatment that could help them recover and get back on with their lives the NHS has said, as it launches a major new mental health campaign. \n\nNew analysis of NHS data shows that over 670,000 people were treated with NHS talking therapy care last year – nearly 70,000 more than pre-pandemic (12% increase on 2019) – with a record 83,000 accessing employment support through the service in 2025 to help them return to work (20% increase on 2024).\n\nYet around one in five adults in England (an estimated 9.4 million) are now affected by a common mental health condition – with the NHS’ top mental health doctor warning that millions are still missing out on available support.\n\nIn response, the NHS has launched a landmark new campaign urging those facing 6 common anxiety conditions that treatment is available for to come forward for support by self-referring online at nhs.uk/talk .\n\nWhile conditions such as post-traumatic stress disorder (PTSD), social anxiety and obsessive compulsive disorder (OCD) have a huge impact on people’s daily lives, a new NHS survey of over 2,000 adults found that nearly 3 in 5 (58%) delay seeking treatment and support as they feel the conditions are “not serious enough” – with 1 in 5 (21%) not seeking help at all.\n\nNHS England’s campaign is backed by Eastenders actress Shona McGarty, TOWIE’s Charlie King, and former professional footballer and Professional Footballers’ Association chair, Clarke Carlisle – who are candidly sharing their own experiences to encourage others to come forward.\n\nNHS talking therapies provide people with practical skills and techniques to overcome a range of mental health conditions like OCD, social anxiety disorder, PTSD, panic disorder, body dysmorphic disorder and phobias. Anyone can self-refer online without needing to see their GP or have an already diagnosed mental health condition.\n\nDr Adrian James, NHS England’s National Medical Director for Mental Health and Neurodiversity said: “While it’s encouraging that thousands more people facing mental health conditions are accessing NHS support than before the pandemic, we know that millions more could benefit from vital NHS talking therapies.\n\n“This landmark new campaign is a critical step to ensuring that everyone struggling with challenging but very common conditions like anxiety and PTSD knows that there is support available to help them get on with their lives again.\n\n“Through proven treatment and support available for free on the NHS, these conditions can be overcome to help people return to work, regain confidence or feel back to their old selves in social situations.\n\n“Our message is clear, if you’re struggling with your mental health, NHS talking therapies are here for you, and you can either self-refer or speak with your local GP practice”.\n\nJo, 40, a data engineer based in Solihull in the West Midlands, has been treated by NHS talking therapies after living undiagnosed with PTSD for years.\n\nAt just 22, Jo received a devastating cancer diagnosis and was given months to live, unless a matching stem cell donor could be found. She began to prepare emotionally for her death – but, against the odds, a donor was found, and she underwent a life-saving transplant. Jo spent her 30s rebuilding herself and moving forward in her life, but her resilience was tested again when her son was born with a rare genetic condition that requires frequent hospital visits and procedures. Constant worry and trying to be “too strong, for too long” eroded her mental health and wiped her out physically.\n\nDuring one of her son’s appointments, the health visitor noticed that she was particularly stressed and encouraged her to look into NHS talking therapies. A year later Jo reached a breaking point and made the decision to seek help. Initially assuming she had general anxiety, Jo discovered through therapy that she had been living with undiagnosed PTSD for years.\n\nShe began eye movement desensitisation and reprocessing therapy – which has completely changed how she approaches life now. Guided by a skilled NHS therapist, she learned to process her unresolved traumatic memories, develop coping mechanisms, and finally understand her reactions. During her therapy, her son underwent a procedure under general anaesthetic, and for the first time, Jo felt calm and able to support him without spiralling. It was the moment she realised: “this is working”.\n\nJo finished therapy a year ago, and the effects have been transformative. Her sleep has improved dramatically; she no longer wakes exhausted from trauma‑filled dreams and feels more present in her life. She is an avid cyclist and has achieved gold medals in Time Trial and Team Triathlon for Team GB at the World Transplant Games.\n\nJo said: “Following various health battles that affected me and my son, I tried for a long time to stay strong. I thought I was just anxious, but I was carrying years of unresolved trauma that I had never processed. I never thought that PTSD could happen to me, but it can affect anyone, as life is so unpredictable.\n\n“Therapy has been unbelievable and completely changed my life. I sleep better, worry less, and I finally feel present in my life again. If you feel like you need help, you do. Put your hand up and self-refer to NHS talking therapies as early as you can. I wish I had done it sooner. Time is so precious”.\n\nAnthony, 37, is a Health, Safety, Environment and Quality Manager from Carlisle, who has lived with panic disorder since he was 16.\n\nFor 20 years he carried shame, fear and confusion about his symptoms, which he says often mimicked those of a heart attack. He tried to manage it alone, worried that opening up would make him seem weak, and only shared his struggles in his early twenties.\n\nAfter the loss of his grandmother in 2024 and a particularly stressful period at work, Anthony began experiencing up to 6 panic attacks a day. Supported by his wife and colleagues, he was referred to NHS talking therapies, something he initially resisted as he wasn’t keen on speaking to a stranger. But over 10-12 sessions, he slowly realised how much relief came from putting his experiences into words. Using tools such as keeping a diary and setting clear goals, he began to understand and manage the physical sensations that once overwhelmed him.\n\nAnthony said: I lived with panic attacks for 20 years, trying to manage it alone, and it impacted every part of my life. The constant worry about when the next panic attack would happen made it really difficult to focus – at work, I couldn’t get through emails or daily tasks, and in my personal life I couldn’t concentrate long enough to read books which was always something that had brought me comfort.\n\n“But NHS talking therapies changed everything – its broken a cycle I thought Id be stuck in forever. I went from having 6 panic attacks a day at its worst, to just 1 or 2 a month now – I finally feel in control again and am able to concentrate for longer periods, so have even started reading again and joined a book club. If you’re struggling, please don’t wait as long as I did. You only get one life, so be brave enough to put yourself first and get the support you deserve.\n\nIn a new survey of 2,002 adults in England, conducted by Censuswide on behalf of the NHS, nearly half of the public said they did not know anything about social anxiety disorder and panic disorder, while two thirds did not know what body dysmorphic disorder (BDD) is.\n\nThe survey found that strong misconceptions around conditions persist – with over a third of the public thinking ‘most people are a bit OCD’ and nearly 3 in 10 believe PTSD mainly affects military veterans and 1 in 5 think social anxiety is ‘the same as being shy’.\n\nThe latest NHS talking therapies statistics show that the vast majority of patients referred to the service access treatment within 6 weeks, with 88.6% accessing services within 6 weeks of their referral last year.\n\nAlso speaking out about the benefits of NHS talking therapies as part of the campaign is Phillip Davis, 41 from Cheshire.\n\nPhillip said: “I struggled with my mental health a lot in the past. But when I was on my own after my divorce, I realised that if I didn’t do something to help myself, I was going to lose my kids. I was probably going to end up in hospital, because I had tried to overdose once at that point. I thought, I can’t survive like this – I knew I needed help, and I didn’t know what to do on my own.\n\n“Every session I’ve had with NHS talking therapies, I’ve walked out feeling at least a little bit better. They don’t tell you what to do, but they help you find ways to deal with things. Sometimes it’s cognitive behavioural therapy (CBT), sometimes it’s just a change in outlook — like looking at something from a different angle. It helps massively.\n\n“And after my last round of talking therapies, when I was also going through employment support, they helped build my self-confidence, and I made some big life choices not long after.\n\nHis message to others is: “Get the help that’s there. I know it can be hard to find, especially for blokes. But it is there, and you should take it”.\n\nThe NHS campaign will run for 6 weeks ​with adverts showing across TV-on-demand services, online video, radio, digital audio and podcasts, social media and search engines.\n\nNHS talking therapies treatment involves talking to a trained professional in a safe space about your thoughts, feelings and behaviours, and can include methods such as CBT, counselling or guided self-help, depending on the mental health condition.\n\nLatest official statistics , published by NHS England, show that people of working age (16 to 64) are more likely to have a common mental health condition than those aged 75 and over. Prevalence among those aged 16 to 64 was nearly 1 in 4 (22.6%), compared to around 1 in 10 of those aged 75 and over (10.2%).\n\nThe new campaign puts a spotlight on 6 common mental health conditions, which are often mistaken or underplayed, and can be treated by NHS talking therapies.\n\nCommon symptoms for these conditions include:\n\nfrequent obsessive thoughts and compulsive behaviours (OCD)\n\nlong-term and overwhelming fear of social situations (social anxiety disorder)\n\ninvoluntarily and vividly reliving traumatic events in the form of flashbacks or nightmares (PTSD)\n\nhaving regular and sudden panic attacks, often for no apparent reason (panic disorder)\n\nhaving an overwhelming and debilitating fear of an object, place, situation, feeling or animal (phobia)\n\nobsessive thoughts and worry about your appearance (body dysmorphic disorder)\n\nFormer Eastenders actress, Shona McGarty, said: “I was always a chatty child, but as I got older, everything changed. Around 15, I suddenly became painfully self-aware. I started overthinking, struggling to hold conversations, even though talking was literally part of my job.\n\n“My social anxiety would happen when meeting new people, with colleagues or even at family gatherings. My heart would race, my hands would sweat, and sometimes I thought I might faint. I sometimes pretend to receive a phone call just to leave a social situation. People would say, “Shona’s so shy,” or “she’s so quiet,” and it really hurt.\n\n“I’m worlds away from that level of panic now, because I’ve learned how to deal with it when it shows up. One thing that helps is imagining a little devil on my shoulder. I acknowledge it, and then I answer back: Thank you, but you’re wrong. I’m in control. I’m safe. People aren’t judging me; they’re listening because they want to hear me speak.\n\n“But the biggest help of all has been talking about it. Acknowledging social anxiety instead of fighting it. You’d be amazed at how many people feel the same way. A problem shared really is a problem halved”.\n\nFormer professional footballer and mental health campaigner, Clarke Carlisle said: “For over a decade, my PTSD caused me to withdraw not just from the world, but more importantly, from my family. My symptoms would be at their worst over Christmas Id experience flashbacks, traumatic memories and racing thoughts, and feared the lead up to December for many years.\n\nNow, looking at the photo of myself and family celebrating my daughter’s 18th birthday during the festive period means the world to me. This was the first winter where I didnt experience symptoms of PTSD but its also a moment that simply wouldn’t exist if I hadn’t received treatment for my mental health, allowing me to talk through feelings and getting me to a place where I can spend precious moments with my family again.\n\nTOWIE’s Charlie King said: “The London Landmarks Half Marathon was a real turning point for me. After months of feeling incredibly low and demotivated because of crippling body dysmorphic disorder (BDD), signing up felt overwhelming, and I genuinely didn’t know if I’d see it through. When my BDD was at its worst, I had become reclusive, Id hide behind a cap, and sometimes even looking at myself in the mirror when brushing my teeth would send me into a spiral. But through therapy, I’ve come to understand it, understand my thought-patterns and tools to manage it.\n\nCrossing that finish line was the first time in a long time that I felt proud of myself.  Similar to my recovery journey, 13 miles once felt impossible, but taking it step by step showed me that I could keep pushing forward.\n\n“So, I look at this photo, and I can truly appreciate myself. None of this would have been possible without therapy, and I am really proud of taking the first step.\n\nMedia medic, Dr Nighat Arif GP said: “The new NHS poll reveals a worrying ‘blind spot’ in public awareness around many common mental health conditions linked to anxiety. This could mean that people are missing out on treatment because they don’t recognise symptoms, are embarrassed by them, or think they are not serious enough to get help for. If your life, work or relationships are being affected by OCD, phobias, body dysmorphic disorder, social anxiety or PTSD, remember that support is available with NHS talking therapies. It’s free, and your GP can refer you, or you can refer yourself online. You’ll speak to a trained therapist about your thoughts and feelings and learn practical skills and techniques so you can overcome your condition and help get you back to living your life”.\n\nYou can find out more and refer yourself for NHS Talking Therapies at nhs.uk/talk .\n\nDate published : 18 February, 2026 \n\nDate last updated : 19 February, 2026 \n\nTopics\n\nMental health",
    "parentUrl": null,
    "metadata": {
      "wordCount": 2464,
      "estimatedReadTime": 10,
      "description": "Millions of adults facing debilitating anxiety conditions are missing out on treatment that could help them recover and get back on with their lives the NHS has said, as it launches a major new mental health campaign. New analysis of NHS data shows that over 670,000 people were treated with NHS talking therapy care last [&#8230;]"
    }
  },
  "content:5dc3d83374593b03": {
    "id": "content:5dc3d83374593b03",
    "url": "https://www.england.nhs.uk/2026/02/thousands-recruited-for-new-era-severe-mental-illness-study/",
    "title": "Thousands recruited for “new era” severe mental illness study",
    "source": "nhs",
    "type": "article",
    "publishedDate": "Sat, 14 Feb 2026 00:01:27 +0000",
    "fetchedDate": "2026-02-27T17:47:23.438Z",
    "contentHash": "6c48b61a84637d54",
    "content": "Thousands of people living with schizophrenia and severe depression are being recruited by the NHS for a major new study which could unlock a “new era” of personalised treatment for severe mental illness. \n\nAs part of the world’s largest mental health study, researchers will analyse the DNA of thousands of people alongside detailed questionnaires to discover what can increase the risk and severity of serious mental health conditions.\n\nFrom this week, almost 50,000 eligible adults living with bipolar, schizophrenia, psychosis or major depression in England and Wales are being invited to join the study, known as GlobalMinds.\n\nNHS England’s DigiTrials service will identify eligible patients and contact them to see if they would like to take part to help find new treatments.\n\nPatients will be provided with at-home sampling kits as well as with targeted support from the NHS for those who are more severely ill or face barriers to using technology.\n\nThe study will combine genetic data from blood or saliva samples given by volunteers with online questionnaire responses and information from their NHS medical records – linking genes, background, biology and mental health.\n\nThe initiative will develop most detailed ever dataset on serious mental health condition to help transform understanding, improve diagnosis and unlock new, more personalised treatments.\n\nThe three-year study, led by mental health data science company Akrivia Health Ltd in partnership with Cardiff University, has been launched in England and Wales initially and later will expand internationally.\n\nDr Adrian James, NHS England’s National Medical Director for Mental Health and Neurodiversity, said : “This major new study could transform our understanding of severe mental illness and lead to the dawn of a new era of personalised treatments for patients with conditions including schizophrenia and severe depression.\n\n“People living with a severe mental illness are affected by their condition every day – and it can often lead to preventable physical conditions and shorter lifespans.\n\n“The new study gives us the opportunity to change the way we treat these conditions and we’re using the NHS’s DigiTrials service is to invite suitable people faster, fairly and at scale. I’d encourage anyone contacted to consider signing up to be part of this ground-breaking study.”\n\nTen NHS mental health trusts are already supporting the project and anyone over 18 from those areas who has been diagnosed with a severe mental health condition can join.\n\nA total of 49,000 people with mental illnesses are being sought, with 2,000 already enrolled and NHS DigiTrials inviting further eligible patients. Another 1,000 people with dementia will also be included in the study.\n\nGlobalMinds’ Chief Investigator, Professor James Walters from Cardiff University, said : “GlobalMinds provides an unprecedented opportunity to uncover and identify the many personal and biological factors behind mental health conditions, so researchers can help clinicians and patients by enabling earlier and more precise diagnosis, and making available optimum treatments for all patients.\n\n“Precision medicine has already revolutionised the treatment of cancer and other rare diseases and we want GlobalMinds to bring the same breakthroughs to mental health. By creating the first large-scale dataset linking both genetic and detailed routine clinical information, GlobalMinds will unlock a new era of personalised mental health care, so we can help tackle the global mental health crisis.”\n\nThe charity Rethink Mental Illness is also supporting the study and will help raise awareness of the research among people severely affected by mental illness.\n\nBrian Dow, Deputy Chief Executive of Rethink Mental Illness, said: “This study has real potential to deepen our understanding and open the door to a new generation of treatments for mental illness.\n\n“The strength of the study lies in the partnership between researchers, the NHS and charities like ours, which means data can be powerfully fused with lived experience, with the voices of people experiencing mental illness remaining front and centre.\n\n“We’re delighted to be supporting the study to reach as many people living with severe mental illness as possible.\n\nGlobalMinds has also been designed to ensure the experience of people taking part is prioritised, with a dedicated Patient Public Involvement and Engagement group.\n\nAkeela Mohammed, a GlobalMinds’ Patient Public Involvement and Engagement Adviser and Founder of Healthy Her, a not-for-profit organisation that empowers South Asian women through wellbeing, sport, and community engagement, said :\n\n“It is vital that research initiatives like GlobalMinds are created from beginning to end with the voices and needs of vulnerable and less included communities at their heart, so that the outcomes benefit as many people as possible.\n\n“That’s why I’ve enjoyed providing both my personal experience of mental health and professional insights into the barriers diverse communities face in accessing research, to this groundbreaking study and I cannot wait to see how this people-powered research will transform lives.”\n\nThe study is supported by the National Institute for Health and Care Research (NIHR), with funding from the Wellcome Trust and Johnson & Johnson.\n\nAnyone aged over 18, who is living with a diagnosed severe mental health condition and lives in participating areas, can sign up at: globalminds.org \n\nFor the GlobalMinds study, eligible patients are being invited to participate and no ones data is shared with researchers without their knowledge and permission.\n\nFurther information\n\nMore information about Global Minds is available here: globalminds.org \n\nGlobalMinds is open to anyone aged 18 or over with a diagnosis of Bipolar, Schizophrenia, Psychosis, Major Depression, or a related condition who live in an area with a participating NHS Trust. Participants sign up online via: globalminds.org and following a brief eligibility check, answer a digital questionnaire. They then are asked to provide either a blood or saliva sample. At-home testing kits or visits are available, and all participants will receive a voucher of up to £50 as a thank you for taking part. Participants can choose to withdraw at any point without giving a reason if they decide to later.\n\nParticipating NHS trusts so far are South West London and St George’s Mental Health NHS Trust; Rotherham Doncaster and South Humber NHS Foundation Trust; Leeds and York Partnership NHS Foundation Trust; Cardiff and Vale University Health Board; Hampshire and Isle of Wight Healthcare NHS Foundation Trust; Birmingham and Solihull Mental Health NHS foundation Trust; Tees, Esk and Wear Valleys NHS Foundation Trust; Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust; Sussex partnership NHS Foundation Trust; Avon and Wiltshire Mental Health Partnership NHS Trust.\n\nFounded in 2019, Akrivia Health is a spin-out from the University of Oxford and the NHS, built on the Clinical Record Interactive Search (CRIS) system. Akrivia works in partnership with 20 NHS secondary care mental healthcare organisations so far across England and Wales, to curate the electronic medical records of >6.3 million patients served by those hospitals. The data curation service Akrivia provides free of charge to these NHS organisations turns unstructured clinical information, inaccessible for research use by those NHS hospitals, into structured and clinically-informative data points to enable better evaluation of treatment pathways and novel research into mental health conditions. Akrivia do their work with the help of practicing clinical academics across the country, and with an engaged network of individuals with lived experience of mental health. Akrivia also delivers novel and exploratory research services utilising the clinical record data to accelerate insights.\n\nThe UK-led GlobalMinds research programme also includes a cohort of 1,000 dementia patients who are being directly recruited through several routes including the NHS hospitals collaborating with GlobalMinds, care homes, or through a partnership with Cera Care a digital-first home healthcare company   piloting in three English locations over the next few months, with further support from the relevant NIHR Research Delivery Networks. More information is available at dementia.globalminds.org \n\nKaizen Bioservices provide sampling logistics for the GlobalMinds study. Global Initiative Ltd provide the website and clinical trial management platform, Trial Deck. Claremont Communications partnered with GlobalMinds to design the study website and patient facing materials.\n\nFor filming opportunities and interviews with representatives of GlobalMinds, contact Tanisha Kamat at  tanisha.kamat@akriviahealth.com  or 07407687936. Case studies of GlobalMinds participants/those with lived experience of mental health conditions are also available on request.\n\nDate published : 14 February, 2026 \n\nDate last updated : 13 February, 2026 \n\nTopics\n\nMental health",
    "parentUrl": null,
    "metadata": {
      "wordCount": 1353,
      "estimatedReadTime": 6,
      "description": "Thousands of people living with schizophrenia and severe depression are being recruited by the NHS for a major new study which could unlock a “new era” of personalised treatment for severe mental illness. As part of the world’s largest mental health study, researchers will analyse the DNA of thousands of people alongside detailed questionnaires to [&#8230;]"
    }
  },
  "content:86e142aa1bc715f3": {
    "id": "content:86e142aa1bc715f3",
    "url": "https://www.england.nhs.uk/2026/02/waiting-list-lowest-3-years-battled-busiest-winter-on-record/",
    "title": "NHS waiting list lowest in almost 3 years as NHS battled busiest winter on record",
    "source": "nhs",
    "type": "article",
    "publishedDate": "Thu, 12 Feb 2026 10:57:05 +0000",
    "fetchedDate": "2026-02-27T17:47:23.952Z",
    "contentHash": "00828bd0445f4d4f",
    "content": "The NHS delivered more elective activity in 2025 than any other year in its history, helping cut the waiting list to its lowest level since February 2023. \n\nStaff delivered a historic high of 18.4 million treatments and operations in 2025, up from 18 million in 2024, as the waiting list dropped to 7.29 million.\n\nToday’s data shows there were 1.43 million treatments delivered in December – an increase of 91,775 on last year – despite 5 days of industrial action by resident doctors, thanks to staff maintaining almost 95% of usual activity during strikes.\n\nThe percentage of people waiting over 18 weeks for treatment slightly decreased to 61.5%, while the percentage of those waiting over 52 weeks dropped to just 1.9% – the lowest since June 2020 – as the Elective Reform Plan continues to drive NHS services to tackle the longest waits and ensure more people are seen quicker.\n\nThe progress comes thanks to the Elective Reform Plan, which has led to an expansion of community diagnostic centres and surgical hubs, creating more evening and weekend clinics, as well as sending patients straight to test rather than multiple clinic visits.\n\nWhile NHS staff used innovative measures across the country including high-intensity theatre (HIT) lists across elective surgery hubs to maximise the number of patients treated in one day or using robotic-assisted surgeries to speed up procedures and increase precision – getting more patients home sooner and recovering faster.\n\nThe data also shows demand across emergency services is showing no signs of letting up, with the NHS on track for its busiest winter ever.\n\nA&E staff experienced a record high January of 2,320,266 A&E attendances – 4.6% higher than in January 2025 – while ambulance staff have faced a record number of incidents across December and January.\n\nDespite this, staff continue to manage the ever-increasing demand, with 206,800 more people admitted, transferred or discharged in less than 4 hours in Type 1 A&E departments across winter so far this year when compared to last year (3.4 million in October 2025 to January 2026 vs 3.2 million in October 2024 to January 2025).\n\n4-hour NHS performance has been at 73.5% across winter so far – up from 72.1% last year and less than 70% the year before.\n\nAmbulance response times are quicker than last winter, with both Category 1 and Category 2 response times down on last year (C1 8:08 and C2 35:04 in January 2026 vs C1 8:16 and C2 35:39 in January 2025).\n\nSeparate figures also published today show hospitals are continuing to face the impact of seasonal viruses, with an average of 1,119 patients in hospital with flu and 929 with norovirus each day last week.\n\nThe government launched the National Cancer Plan last week, committing the NHS to meet all cancer waiting time standards by 2029, with hundreds of thousands more patients treated within 62 days.\n\nStaff carried out 2.37 million tests and checks in December alongside 77.4% of people receiving the all-clear or a cancer diagnosis within 4 weeks of an urgent suspected cancer referral – the highest proportion in 9 months (76.7% in April 2025).\n\nDuncan Burton, Chief Nursing Officer for England, said: “Completing a historic high of elective activity is a triumph for NHS staff who continue to innovate and go above and beyond to treat more patients, faster.\n\n“Thanks to early preparations and careful planning, ambulance waits are shorter and A&E treatment times are faster this winter – even as staff face record demand – while we know there is further to go in improving patient flow and cutting the longest emergency department waits.”\n\n“We saw a great response from the public with many people getting protected against winter viruses this year, which is paying off for patients and keeping more people well and at home.\n\n“With a particularly wet start to the year and cold weather alerts issued for England over the weekend, as ever, it’s really important the public continue to come forward for care in the usual way – by dialling 999 in an emergency and otherwise using 111 online, your local pharmacist or GP”.\n\nHealth and Social Care Secretary, Wes Streeting said: “Despite having to deal with flu and industrial action, the NHS has managed to continue cutting waiting lists, thanks to a Herculean effort this winter.\n\n“This government has cut waiting lists by more than 330,000, with hundreds of thousands more people treated within 18 weeks. That’s not happening by chance – it’s because we delivered record levels of care in 2025.\n\n“This progress is driven by unprecedented investment and modernisation of our health service, and above all by the dedication of NHS staff.\n\n“Whether it’s by opening up new community diagnostic centres, rolling out surgical hubs to tackle backlogs, or investing in modern equipment and technology, we are rebuilding our NHS.\n\n“There’s so much more to do, but people can take hope and optimism from the fact that the NHS is finally on the road to recovery.”\n\nYellow cold health alerts for England have been issued by the UK Health Security Agency for either side of the weekend – with temperatures expected to drop from tomorrow until the start of next week (Friday 13 to Monday 16 February), as temperatures have fallen in recent days to drop below freezing which could lead to increased pressure on hospitals, especially by vulnerable people.\n\nDate published : 12 February, 2026 \n\nDate last updated : 12 February, 2026 \n\nTopics\n\nElective care \nWinter news and guidance",
    "parentUrl": null,
    "metadata": {
      "wordCount": 914,
      "estimatedReadTime": 4,
      "description": "The NHS delivered more elective activity in 2025 than any other year in its history, helping cut the waiting list to its lowest level since February 2023. Staff delivered a historic high of 18.4 million treatments and operations in 2025, up from 18 million in 2024, as the waiting list dropped to 7.29 million. Today’s [&#8230;]"
    }
  },
  "content:e5334b333ef4439d": {
    "id": "content:e5334b333ef4439d",
    "url": "https://www.england.nhs.uk/2026/02/early-nhs-preparation-paying-off-amid-shorter-ambulance-handover-times/",
    "title": "Early NHS preparation ‘paying off’ amid shorter ambulance handover times",
    "source": "nhs",
    "type": "article",
    "publishedDate": "Thu, 05 Feb 2026 10:00:21 +0000",
    "fetchedDate": "2026-02-27T17:47:24.478Z",
    "contentHash": "98ea70962278a200",
    "content": "Ambulances handed over patients more than 2 minutes faster last month despite facing their busiest January since before COVID-19. \n\nProvisional figures out today show there were 420,324 ambulances handovers with known times in January, the highest number for the month since 2020 and a 5.2% increase compared to 399,415 in January last year.\n\nDespite this, the average handover time this January (37:16) was more than 2 minutes faster than January 2025 (39:27) and last weeks average time was almost 5 minutes (4:42) faster than the same week last year.\n\nThe improvement in performance amid high demand is a sign of the positive impact of NHS planning and preparation for winter, as services focused on keeping more ambulances on the road and improving patient flow through hospitals.\n\nWinter viruses continue to add to demand in hospitals with more than 1,000 (1,093) adult beds on average closed or occupied each day last week due to norovirus. There were also still more than 900 patients (904) on average in hospital each day last week with the bug.\n\nThere were also almost 4,000 more calls (3,878) received by NHS 111 services (381,479) compared to the same week last year (377,601).\n\nFlu rates continue to drop since last month’s peak, but there was still an average of almost 1,500 (1,491) patients in hospital with flu and an average of 630 patients in hospital with COVID-19 per day last week.\n\nVaccination data shows 18.8 million flu vaccines have been delivered since the autumn/winter campaign began – around half a million more than at the same point last year, helping to keep more people out of hospital and protected against getting seriously ill from the virus.\n\nOn Monday (2 February 2026) the government announced that from April the respiratory syncytial virus (RSV) vaccine will be offered to additional groups most vulnerable to serious outcomes from infection, specifically adults aged 80 years and over and all residents in care homes for older adults.\n\nPeople turning 75 or who are between 75 and 79 as well as pregnant women can come forward now for their jab and get protected.\n\nNHS National Medical Director Professor Meghana Pandit said: “Early NHS preparation and planning for winter is paying off for patients.\n\n“Patients are being handed over from ambulances quicker, even amid high demand on services with more handovers last month than any January since before the pandemic.\n\n“Higher vaccination rates are helping to limit the impact of winter viruses like flu, though cases of the vomiting bug are still high in hospitals, which staff are working extremely hard to keep under control.\n\n“Vaccinations remain the best protection available from seasonal viruses, so if you are eligible for your flu, COVID-19 or RSV jab please come forward”.\n\nHealth and Social Care Secretary Wes Streeting said: “By planning for winter earlier than ever before, we’re now seeing real improvements in urgent and emergency care. Ambulance response times and handovers are faster, the longest A&E delays are falling compared to last year, and flu is taking up fewer hospital beds.\n\n“We backed this with £450 million for urgent and emergency care, 500 new ambulances on the road, and millions of flu, COVID-19 and RSV vaccinations to keep people well and out of hospital.\n\n“Winter pressures haven’t disappeared, but we’re learning from this season to strengthen our response further and break the cycle of struggle the NHS faces each winter.\n\nDate published : 5 February, 2026 \n\nDate last updated : 5 February, 2026 \n\nTopics\n\nNHS 111 \nUrgent and emergency care \nVaccination",
    "parentUrl": null,
    "metadata": {
      "wordCount": 586,
      "estimatedReadTime": 3,
      "description": "Ambulances handed over patients more than 2 minutes faster last month despite facing their busiest January since before COVID-19. Provisional figures out today show there were 420,324 ambulances handovers with known times in January, the highest number for the month since 2020 and a 5.2% increase compared to 399,415 in January last year. Despite this, [&#8230;]"
    }
  },
  "content:725e5add6fa05488": {
    "id": "content:725e5add6fa05488",
    "url": "https://www.england.nhs.uk/2026/01/nhs-services-tackling-winter-head-on/",
    "title": "NHS services tackling winter head on",
    "source": "nhs",
    "type": "article",
    "publishedDate": "Thu, 29 Jan 2026 09:45:31 +0000",
    "fetchedDate": "2026-02-27T17:47:24.992Z",
    "contentHash": "2e8b9eda211c8505",
    "content": "Ambulances unloaded patients three minutes faster last week, even as A&Es saw more ambulance handovers than any point last winter. \n\nFigures released today show there were 94,551 ambulance handovers last week – higher than the busiest week last year (94,493 w/e 29 December 2024), and up almost 1,000 on the week previous and over 3,250 more than the same week last year.\n\nDespite this, the average handover time last week (34:32) was almost 3 minutes faster than the week previous (37:22) and an improvement on the same point last year (35:04).\n\nThis comes almost eight months since the publication of the NHS’ urgent and emergency care plan, which set out a focus on keeping more ambulances on the road and improving patient flow through hospitals.\n\nThe ‘winter vomiting bug’ continues to build demand in hospitals with an average of over 1,100 adult beds closed or occupied each day last week due to norovirus.\n\nThere were an average of 950 patients in hospital each day last week with the bug – 127 more than the week previous and nearing the peak of cases we saw in February last year (961 w/e 2 February 2025).\n\nThere were 360,286 calls answered by NHS 111 last week – almost 5,000 more than the same week last year (355,452 w/e 26 January 2025).\n\nFlu rates have dropped since last month’s peak, but there was still an average of 1,987 patients in hospital with flu and an average of 647 patients in hospital with covid-19 per day last week.\n\nThis follows latest vaccination data which shows 18.8 million flu vaccines have been delivered since the autumn/winter campaign began – around half a million more than at the same point last year, helping to keep more people out of hospital and protected against getting seriously ill from the virus.\n\n4.7 million covid-19 vaccinations have been delivered so far this season and 2.5 million RSV vaccinations since the rollout kicked off – including almost 485,000 to pregnant women, helping to protect their babies against respiratory viruses from the moment they are born.\n\nNHS National Medical Director Professor Meghana Pandit said : “Hospitals continue to face sustained pressure from viruses and other demands, but NHS staff have worked hard to tackle winter head on and it looks like this is having an impact.\n\n“The NHS prepared earlier for winter than ever before and it is reassuring to see an improvement on ambulance handover times and fewer patients in hospital with flu than in previous years in part thanks to staff delivering half a million more vaccinations than at the same point last year.\n\n“Seasonal viruses continue to cause disruption and take up hospital beds, with cases of the winter vomiting bug triple what they were at the start of the month.\n\n“You can prevent the spread of norovirus by frequent handwashing with soap and water and not returning to work, school or visiting hospitals until you are 48 hours symptom-free.\n\nHealth and Social Care Secretary Wes Streeting said : “This winter has pushed the NHS hard, but staff are delivering. Ambulances are handing over faster, delays are coming down and flu is taking up fewer hospital beds than last year, even with demand running at near-record levels. That’s real progress, driven by the dedication of frontline staff and better preparation than ever before.\n\n“We backed that effort with £450 million for urgent and emergency care, 500 new ambulances on the road and millions of vaccinations delivered this winter for flu, Covid and RSV, keeping people protected and out of hospital.\n\n“Winter pressures haven’t gone away, but the NHS is meeting them head on. If you’re eligible, get vaccinated, follow public health advice and help us keep the service there for everyone who needs it.”\n\nAmy Douglas, Lead Epidemiologist at UKHSA, said :Norovirus activity has remained high in recent weeks, particularly among those aged 65 years and over and is now rising in children aged under 5 years too. Outbreaks in hospital settings have increased too, so please remember the simple steps we can all take to stop norovirus spreading.\n\n“Washing your hands with soap and warm water and using bleach-based products to clean surfaces will also help stop infections from spreading. Alcohol gels do not kill norovirus so don’t rely on these alone.\n\n“If you have diarrhoea and vomiting, don’t return to work, school or nursery until 48 hours after your symptoms have stopped and don’t prepare food for others in that time either. If you are unwell, avoid visiting people in hospitals and care homes to prevent passing on the infection to those most vulnerable.”\n\nThe weekly situation report publications can be found here:  Statistics » Urgent and Emergency Care Daily Situation Reports 2025-26 \n\nDate published : 29 January, 2026 \n\nDate last updated : 6 February, 2026 \n\nTopics\n\nWinter news and guidance",
    "parentUrl": null,
    "metadata": {
      "wordCount": 804,
      "estimatedReadTime": 4,
      "description": "Ambulances unloaded patients three minutes faster last week, even as A&#38;Es saw more ambulance handovers than any point last winter. Figures released today show there were 94,551 ambulance handovers last week – higher than the busiest week last year (94,493 w/e 29 December 2024), and up almost 1,000 on the week previous and over 3,250 [&#8230;]"
    }
  }
}